app/Controllers/Post.php

    public function index() {
        $session = session();
        $postModel = new Posts();
        $data['posts'] = $postModel->findAll();
        $data['myposts'] = $postModel->where('author', $session->get("username"))->findAll();
---
SELECT *
FROM `posts`
SELECT *
FROM `posts`
WHERE `author` = 'test'

    public function addpost() {
        $session = session();
        helper('form');
        $rules = [
            'post_title' => "required",
            'post' => 'required'
        ];
        if ($this->validate($rules)) {
            $postModel = new Posts();
            $data = [
                'post_title' => $this->request->getVar('post_title'),
                'post' => $this->request->getVar('post'),
                'author' => $session->get("username")
            ];
            $postModel->save($data);
---
INSERT INTO `posts` (`post_title`, `post`, `author`) VALUES ('Adding new post', 'yooo yoooy oo\r\n', 'test')

    public function updatepostform($id = null) {
        $postModel = new Posts();
        $data['post'] = $postModel->where('id', $id)->first();
---
SELECT *
FROM `posts`
WHERE `id` = '4'
 LIMIT 1

    public function deletepost($id = null) {
        $postModel = new Posts();
        $data['post'] = $postModel->where('id', $id)->delete($id);
---
DELETE FROM `posts`
WHERE `id` = '4'
AND `id` IN ('4')